adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
//
// Automatically generated by ipdlc.
// Edit at your own risk
//


#include "mozilla/net/PSocketProcessChild.h"
#include "mozilla/ProfilerLabels.h"
#include "mozilla/ProfilerMarkers.h"
#include "mozilla/ipc/URIUtils.h"
#include "mozilla/net/SocketProcessChild.h"
#include "nsID.h"

#include "mozilla/net/PDNSRequestChild.h"
#include "mozilla/net/PSocketProcessBridgeChild.h"
#include "mozilla/PProfilerChild.h"
#include "mozilla/net/PWebrtcTCPSocketChild.h"
#include "mozilla/net/PHttpTransactionChild.h"
#include "mozilla/net/PHttpConnectionMgrChild.h"
#include "mozilla/ipc/PFileDescriptorSetChild.h"
#include "mozilla/ipc/PChildToParentStreamChild.h"
#include "mozilla/ipc/PParentToChildStreamChild.h"
#include "mozilla/net/PInputChannelThrottleQueueChild.h"
#include "mozilla/ipc/PBackgroundChild.h"
#include "mozilla/net/PAltServiceChild.h"
#include "mozilla/net/PAltSvcTransactionChild.h"
#include "mozilla/net/PTRRServiceChild.h"
#include "mozilla/net/PProxyConfigLookupChild.h"
#include "mozilla/net/PNativeDNSResolverOverrideChild.h"
#include "mozilla/PRemoteLazyInputStreamChild.h"

#include "ipc/IPCMessageUtils.h"
#include "nsIFile.h"
#include "mozilla/ipc/Endpoint.h"
#include "mozilla/ipc/ProtocolMessageUtils.h"
#include "mozilla/ipc/ProtocolUtils.h"
#include "mozilla/ipc/ShmemMessageUtils.h"
#include "mozilla/ipc/TaintingIPCUtils.h"

namespace mozilla {
namespace net {


auto PSocketProcessChild::RecvPHttpTransactionConstructor(PHttpTransactionChild* actor) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPParentToChildStreamConstructor(PParentToChildStreamChild* actor) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPHttpConnectionMgrConstructor(
        PHttpConnectionMgrChild* actor,
        const HttpHandlerInitArgs& aArgs) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPInputChannelThrottleQueueConstructor(
        PInputChannelThrottleQueueChild* actor,
        const uint32_t& meanBytesPerSecond,
        const uint32_t& maxBytesPerSecond) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPAltSvcTransactionConstructor(
        PAltSvcTransactionChild* actor,
        const HttpConnectionInfoCloneArgs& aConnInfo,
        const uint32_t& aCaps) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPTRRServiceConstructor(
        PTRRServiceChild* actor,
        const bool& aCaptiveIsPassed,
        const bool& aParentalControlEnabled,
        nsTArray<nsCString>&& aDNSSuffixList) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPNativeDNSResolverOverrideConstructor(PNativeDNSResolverOverrideChild* actor) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPRemoteLazyInputStreamConstructor(
        PRemoteLazyInputStreamChild* actor,
        const nsID& aID,
        const uint64_t& aSize) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPFileDescriptorSetConstructor(
        PFileDescriptorSetChild* actor,
        const FileDescriptor& fd) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::RecvPDNSRequestConstructor(
        PDNSRequestChild* actor,
        const nsCString& hostName,
        const nsCString& trrServer,
        const uint16_t& type,
        const OriginAttributes& originAttributes,
        const uint32_t& flags) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessChild::ProcessingError(
        Result aCode,
        const char* aReason) -> void
{
}

auto PSocketProcessChild::ShouldContinueFromReplyTimeout() -> bool
{
    return true;
}

auto PSocketProcessChild::EnteredCxxStack() -> void
{
}

auto PSocketProcessChild::ExitedCxxStack() -> void
{
}

auto PSocketProcessChild::EnteredCall() -> void
{
}

auto PSocketProcessChild::ExitedCall() -> void
{
}

MOZ_IMPLICIT PSocketProcessChild::PSocketProcessChild() :
    mozilla::ipc::IToplevelProtocol("PSocketProcessChild", PSocketProcessMsgStart, mozilla::ipc::ChildSide)
{
    MOZ_COUNT_CTOR(PSocketProcessChild);
}

PSocketProcessChild::~PSocketProcessChild()
{
    MOZ_COUNT_DTOR(PSocketProcessChild);
}

auto PSocketProcessChild::ManagedPDNSRequestChild(nsTArray<PDNSRequestChild*>& aArr) const -> void
{
    mManagedPDNSRequestChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPDNSRequestChild() const -> const ManagedContainer<PDNSRequestChild>&
{
    return mManagedPDNSRequestChild;
}

auto PSocketProcessChild::ManagedPWebrtcTCPSocketChild(nsTArray<PWebrtcTCPSocketChild*>& aArr) const -> void
{
    mManagedPWebrtcTCPSocketChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPWebrtcTCPSocketChild() const -> const ManagedContainer<PWebrtcTCPSocketChild>&
{
    return mManagedPWebrtcTCPSocketChild;
}

auto PSocketProcessChild::ManagedPFileDescriptorSetChild(nsTArray<PFileDescriptorSetChild*>& aArr) const -> void
{
    mManagedPFileDescriptorSetChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPFileDescriptorSetChild() const -> const ManagedContainer<PFileDescriptorSetChild>&
{
    return mManagedPFileDescriptorSetChild;
}

auto PSocketProcessChild::ManagedPHttpTransactionChild(nsTArray<PHttpTransactionChild*>& aArr) const -> void
{
    mManagedPHttpTransactionChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPHttpTransactionChild() const -> const ManagedContainer<PHttpTransactionChild>&
{
    return mManagedPHttpTransactionChild;
}

auto PSocketProcessChild::ManagedPHttpConnectionMgrChild(nsTArray<PHttpConnectionMgrChild*>& aArr) const -> void
{
    mManagedPHttpConnectionMgrChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPHttpConnectionMgrChild() const -> const ManagedContainer<PHttpConnectionMgrChild>&
{
    return mManagedPHttpConnectionMgrChild;
}

auto PSocketProcessChild::ManagedPChildToParentStreamChild(nsTArray<PChildToParentStreamChild*>& aArr) const -> void
{
    mManagedPChildToParentStreamChild.ToArray(aArr);
}

