adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
auto PSocketProcessChild::ManagedPChildToParentStreamChild() const -> const ManagedContainer<PChildToParentStreamChild>&
{
    return mManagedPChildToParentStreamChild;
}

auto PSocketProcessChild::ManagedPParentToChildStreamChild(nsTArray<PParentToChildStreamChild*>& aArr) const -> void
{
    mManagedPParentToChildStreamChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPParentToChildStreamChild() const -> const ManagedContainer<PParentToChildStreamChild>&
{
    return mManagedPParentToChildStreamChild;
}

auto PSocketProcessChild::ManagedPInputChannelThrottleQueueChild(nsTArray<PInputChannelThrottleQueueChild*>& aArr) const -> void
{
    mManagedPInputChannelThrottleQueueChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPInputChannelThrottleQueueChild() const -> const ManagedContainer<PInputChannelThrottleQueueChild>&
{
    return mManagedPInputChannelThrottleQueueChild;
}

auto PSocketProcessChild::ManagedPAltServiceChild(nsTArray<PAltServiceChild*>& aArr) const -> void
{
    mManagedPAltServiceChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPAltServiceChild() const -> const ManagedContainer<PAltServiceChild>&
{
    return mManagedPAltServiceChild;
}

auto PSocketProcessChild::ManagedPAltSvcTransactionChild(nsTArray<PAltSvcTransactionChild*>& aArr) const -> void
{
    mManagedPAltSvcTransactionChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPAltSvcTransactionChild() const -> const ManagedContainer<PAltSvcTransactionChild>&
{
    return mManagedPAltSvcTransactionChild;
}

auto PSocketProcessChild::ManagedPTRRServiceChild(nsTArray<PTRRServiceChild*>& aArr) const -> void
{
    mManagedPTRRServiceChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPTRRServiceChild() const -> const ManagedContainer<PTRRServiceChild>&
{
    return mManagedPTRRServiceChild;
}

auto PSocketProcessChild::ManagedPProxyConfigLookupChild(nsTArray<PProxyConfigLookupChild*>& aArr) const -> void
{
    mManagedPProxyConfigLookupChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPProxyConfigLookupChild() const -> const ManagedContainer<PProxyConfigLookupChild>&
{
    return mManagedPProxyConfigLookupChild;
}

auto PSocketProcessChild::ManagedPNativeDNSResolverOverrideChild(nsTArray<PNativeDNSResolverOverrideChild*>& aArr) const -> void
{
    mManagedPNativeDNSResolverOverrideChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPNativeDNSResolverOverrideChild() const -> const ManagedContainer<PNativeDNSResolverOverrideChild>&
{
    return mManagedPNativeDNSResolverOverrideChild;
}

auto PSocketProcessChild::ManagedPRemoteLazyInputStreamChild(nsTArray<PRemoteLazyInputStreamChild*>& aArr) const -> void
{
    mManagedPRemoteLazyInputStreamChild.ToArray(aArr);
}

auto PSocketProcessChild::ManagedPRemoteLazyInputStreamChild() const -> const ManagedContainer<PRemoteLazyInputStreamChild>&
{
    return mManagedPRemoteLazyInputStreamChild;
}

auto PSocketProcessChild::AllManagedActors(nsTArray<RefPtr<mozilla::ipc::ActorLifecycleProxy>>& arr__) const -> void
{
    uint32_t total = 0;
    total += mManagedPDNSRequestChild.Count();
    total += mManagedPWebrtcTCPSocketChild.Count();
    total += mManagedPFileDescriptorSetChild.Count();
    total += mManagedPHttpTransactionChild.Count();
    total += mManagedPHttpConnectionMgrChild.Count();
    total += mManagedPChildToParentStreamChild.Count();
    total += mManagedPParentToChildStreamChild.Count();
    total += mManagedPInputChannelThrottleQueueChild.Count();
    total += mManagedPAltServiceChild.Count();
    total += mManagedPAltSvcTransactionChild.Count();
    total += mManagedPTRRServiceChild.Count();
    total += mManagedPProxyConfigLookupChild.Count();
    total += mManagedPNativeDNSResolverOverrideChild.Count();
    total += mManagedPRemoteLazyInputStreamChild.Count();
    arr__.SetCapacity(total);

    for (auto it = mManagedPDNSRequestChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPWebrtcTCPSocketChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPFileDescriptorSetChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPHttpTransactionChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPHttpConnectionMgrChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPChildToParentStreamChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPParentToChildStreamChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPInputChannelThrottleQueueChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPAltServiceChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPAltSvcTransactionChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPTRRServiceChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPProxyConfigLookupChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPNativeDNSResolverOverrideChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

    for (auto it = mManagedPRemoteLazyInputStreamChild.ConstIter(); !it.Done(); it.Next()) {
        arr__.AppendElement(it.Get()->GetKey()->GetLifecycleProxy());
    }

