adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
}

auto PSocketProcessChild::OpenPDNSRequestEndpoint(PDNSRequestChild* aActor) -> ManagedEndpoint<PDNSRequestParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PDNSRequestChild actor");
        return ManagedEndpoint<PDNSRequestParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPDNSRequestChild.PutEntry(aActor);

    return ManagedEndpoint<PDNSRequestParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPDNSRequestEndpoint(
        ManagedEndpoint<PDNSRequestChild> aEndpoint,
        PDNSRequestChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PDNSRequestChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPDNSRequestChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPWebrtcTCPSocketEndpoint(PWebrtcTCPSocketChild* aActor) -> ManagedEndpoint<PWebrtcTCPSocketParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PWebrtcTCPSocketChild actor");
        return ManagedEndpoint<PWebrtcTCPSocketParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPWebrtcTCPSocketChild.PutEntry(aActor);

    return ManagedEndpoint<PWebrtcTCPSocketParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPWebrtcTCPSocketEndpoint(
        ManagedEndpoint<PWebrtcTCPSocketChild> aEndpoint,
        PWebrtcTCPSocketChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PWebrtcTCPSocketChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPWebrtcTCPSocketChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPFileDescriptorSetEndpoint(PFileDescriptorSetChild* aActor) -> ManagedEndpoint<PFileDescriptorSetParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PFileDescriptorSetChild actor");
        return ManagedEndpoint<PFileDescriptorSetParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPFileDescriptorSetChild.PutEntry(aActor);

    return ManagedEndpoint<PFileDescriptorSetParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPFileDescriptorSetEndpoint(
        ManagedEndpoint<PFileDescriptorSetChild> aEndpoint,
        PFileDescriptorSetChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PFileDescriptorSetChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPFileDescriptorSetChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPHttpTransactionEndpoint(PHttpTransactionChild* aActor) -> ManagedEndpoint<PHttpTransactionParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpTransactionChild actor");
        return ManagedEndpoint<PHttpTransactionParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPHttpTransactionChild.PutEntry(aActor);

    return ManagedEndpoint<PHttpTransactionParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPHttpTransactionEndpoint(
        ManagedEndpoint<PHttpTransactionChild> aEndpoint,
        PHttpTransactionChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpTransactionChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPHttpTransactionChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPHttpConnectionMgrEndpoint(PHttpConnectionMgrChild* aActor) -> ManagedEndpoint<PHttpConnectionMgrParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpConnectionMgrChild actor");
        return ManagedEndpoint<PHttpConnectionMgrParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPHttpConnectionMgrChild.PutEntry(aActor);

    return ManagedEndpoint<PHttpConnectionMgrParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPHttpConnectionMgrEndpoint(
        ManagedEndpoint<PHttpConnectionMgrChild> aEndpoint,
        PHttpConnectionMgrChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpConnectionMgrChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPHttpConnectionMgrChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPChildToParentStreamEndpoint(PChildToParentStreamChild* aActor) -> ManagedEndpoint<PChildToParentStreamParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PChildToParentStreamChild actor");
        return ManagedEndpoint<PChildToParentStreamParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPChildToParentStreamChild.PutEntry(aActor);

    return ManagedEndpoint<PChildToParentStreamParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPChildToParentStreamEndpoint(
        ManagedEndpoint<PChildToParentStreamChild> aEndpoint,
        PChildToParentStreamChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PChildToParentStreamChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPChildToParentStreamChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPParentToChildStreamEndpoint(PParentToChildStreamChild* aActor) -> ManagedEndpoint<PParentToChildStreamParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PParentToChildStreamChild actor");
        return ManagedEndpoint<PParentToChildStreamParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPParentToChildStreamChild.PutEntry(aActor);

    return ManagedEndpoint<PParentToChildStreamParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPParentToChildStreamEndpoint(
        ManagedEndpoint<PParentToChildStreamChild> aEndpoint,
        PParentToChildStreamChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PParentToChildStreamChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPParentToChildStreamChild.PutEntry(aActor);

