adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
    return true;
}

auto PSocketProcessChild::OpenPInputChannelThrottleQueueEndpoint(PInputChannelThrottleQueueChild* aActor) -> ManagedEndpoint<PInputChannelThrottleQueueParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PInputChannelThrottleQueueChild actor");
        return ManagedEndpoint<PInputChannelThrottleQueueParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPInputChannelThrottleQueueChild.PutEntry(aActor);

    return ManagedEndpoint<PInputChannelThrottleQueueParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPInputChannelThrottleQueueEndpoint(
        ManagedEndpoint<PInputChannelThrottleQueueChild> aEndpoint,
        PInputChannelThrottleQueueChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PInputChannelThrottleQueueChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPInputChannelThrottleQueueChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPAltServiceEndpoint(PAltServiceChild* aActor) -> ManagedEndpoint<PAltServiceParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltServiceChild actor");
        return ManagedEndpoint<PAltServiceParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPAltServiceChild.PutEntry(aActor);

    return ManagedEndpoint<PAltServiceParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPAltServiceEndpoint(
        ManagedEndpoint<PAltServiceChild> aEndpoint,
        PAltServiceChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltServiceChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPAltServiceChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPAltSvcTransactionEndpoint(PAltSvcTransactionChild* aActor) -> ManagedEndpoint<PAltSvcTransactionParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltSvcTransactionChild actor");
        return ManagedEndpoint<PAltSvcTransactionParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPAltSvcTransactionChild.PutEntry(aActor);

    return ManagedEndpoint<PAltSvcTransactionParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPAltSvcTransactionEndpoint(
        ManagedEndpoint<PAltSvcTransactionChild> aEndpoint,
        PAltSvcTransactionChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltSvcTransactionChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPAltSvcTransactionChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPTRRServiceEndpoint(PTRRServiceChild* aActor) -> ManagedEndpoint<PTRRServiceParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PTRRServiceChild actor");
        return ManagedEndpoint<PTRRServiceParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPTRRServiceChild.PutEntry(aActor);

    return ManagedEndpoint<PTRRServiceParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPTRRServiceEndpoint(
        ManagedEndpoint<PTRRServiceChild> aEndpoint,
        PTRRServiceChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PTRRServiceChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPTRRServiceChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPProxyConfigLookupEndpoint(PProxyConfigLookupChild* aActor) -> ManagedEndpoint<PProxyConfigLookupParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PProxyConfigLookupChild actor");
        return ManagedEndpoint<PProxyConfigLookupParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPProxyConfigLookupChild.PutEntry(aActor);

    return ManagedEndpoint<PProxyConfigLookupParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPProxyConfigLookupEndpoint(
        ManagedEndpoint<PProxyConfigLookupChild> aEndpoint,
        PProxyConfigLookupChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PProxyConfigLookupChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPProxyConfigLookupChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPNativeDNSResolverOverrideEndpoint(PNativeDNSResolverOverrideChild* aActor) -> ManagedEndpoint<PNativeDNSResolverOverrideParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PNativeDNSResolverOverrideChild actor");
        return ManagedEndpoint<PNativeDNSResolverOverrideParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPNativeDNSResolverOverrideChild.PutEntry(aActor);

    return ManagedEndpoint<PNativeDNSResolverOverrideParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessChild::BindPNativeDNSResolverOverrideEndpoint(
        ManagedEndpoint<PNativeDNSResolverOverrideChild> aEndpoint,
        PNativeDNSResolverOverrideChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PNativeDNSResolverOverrideChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPNativeDNSResolverOverrideChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::OpenPRemoteLazyInputStreamEndpoint(PRemoteLazyInputStreamChild* aActor) -> ManagedEndpoint<PRemoteLazyInputStreamParent>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PRemoteLazyInputStreamChild actor");
        return ManagedEndpoint<PRemoteLazyInputStreamParent>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPRemoteLazyInputStreamChild.PutEntry(aActor);

    return ManagedEndpoint<PRemoteLazyInputStreamParent>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

