adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
auto PSocketProcessChild::BindPRemoteLazyInputStreamEndpoint(
        ManagedEndpoint<PRemoteLazyInputStreamChild> aEndpoint,
        PRemoteLazyInputStreamChild* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PRemoteLazyInputStreamChild actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPRemoteLazyInputStreamChild.PutEntry(aActor);

    return true;
}

auto PSocketProcessChild::SendInitCrashReporter(const NativeThreadId& threadId) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_InitCrashReporter(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, threadId);
    // Sentinel = 'threadId'
    (msg__)->WriteSentinel(248185638);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitCrashReporter", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendAddMemoryReport(const MemoryReport& aReport) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_AddMemoryReport(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aReport);
    // Sentinel = 'aReport'
    (msg__)->WriteSentinel(184025822);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_AddMemoryReport", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendAccumulateChildHistograms(const nsTArray<HistogramAccumulation>& accumulations) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_AccumulateChildHistograms(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, accumulations);
    // Sentinel = 'accumulations'
    (msg__)->WriteSentinel(632030585);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_AccumulateChildHistograms", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendAccumulateChildKeyedHistograms(const nsTArray<KeyedHistogramAccumulation>& accumulations) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_AccumulateChildKeyedHistograms(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, accumulations);
    // Sentinel = 'accumulations'
    (msg__)->WriteSentinel(632030585);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_AccumulateChildKeyedHistograms", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendUpdateChildScalars(const nsTArray<ScalarAction>& actions) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_UpdateChildScalars(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, actions);
    // Sentinel = 'actions'
    (msg__)->WriteSentinel(193200882);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_UpdateChildScalars", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendUpdateChildKeyedScalars(const nsTArray<KeyedScalarAction>& actions) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_UpdateChildKeyedScalars(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, actions);
    // Sentinel = 'actions'
    (msg__)->WriteSentinel(193200882);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_UpdateChildKeyedScalars", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendRecordChildEvents(const nsTArray<ChildEventData>& events) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_RecordChildEvents(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, events);
    // Sentinel = 'events'
    (msg__)->WriteSentinel(149619350);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_RecordChildEvents", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendRecordDiscardedData(const DiscardedData& data) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_RecordDiscardedData(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, data);
    // Sentinel = 'data'
    (msg__)->WriteSentinel(67109275);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_RecordDiscardedData", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

