adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
auto PSocketProcessChild::SendPWebrtcTCPSocketConstructor(const mozilla::Maybe<TabId>& tabId) -> PWebrtcTCPSocketChild*
{
    PWebrtcTCPSocketChild* actor = (static_cast<SocketProcessChild*>(this))->AllocPWebrtcTCPSocketChild(tabId);
    return SendPWebrtcTCPSocketConstructor(actor, tabId);
}

auto PSocketProcessChild::SendPWebrtcTCPSocketConstructor(
        PWebrtcTCPSocketChild* actor,
        const mozilla::Maybe<TabId>& tabId) -> PWebrtcTCPSocketChild*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PWebrtcTCPSocketChild actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPWebrtcTCPSocketChild.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PWebrtcTCPSocketConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, tabId);
    // Sentinel = 'tabId'
    (msg__)->WriteSentinel(99156453);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PWebrtcTCPSocketConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PWebrtcTCPSocketChild constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PWebrtcTCPSocketMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessChild::SendPChildToParentStreamConstructor() -> PChildToParentStreamChild*
{
    PChildToParentStreamChild* actor = (static_cast<SocketProcessChild*>(this))->AllocPChildToParentStreamChild();
    return SendPChildToParentStreamConstructor(actor);
}

auto PSocketProcessChild::SendPChildToParentStreamConstructor(PChildToParentStreamChild* actor) -> PChildToParentStreamChild*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PChildToParentStreamChild actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPChildToParentStreamChild.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PChildToParentStreamConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PChildToParentStreamConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PChildToParentStreamChild constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PChildToParentStreamMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessChild::SendObserveHttpActivity(
        const HttpActivityArgs& aActivityArgs,
        const uint32_t& aActivityType,
        const uint32_t& aActivitySubtype,
        const PRTime& aTimestamp,
        const uint64_t& aExtraSizeData,
        const nsCString& aExtraStringData) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_ObserveHttpActivity(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aActivityArgs);
    // Sentinel = 'aActivityArgs'
    (msg__)->WriteSentinel(599721276);
    WriteIPDLParam(msg__, this, aActivityType);
    // Sentinel = 'aActivityType'
    (msg__)->WriteSentinel(606340433);
    WriteIPDLParam(msg__, this, aActivitySubtype);
    // Sentinel = 'aActivitySubtype'
    (msg__)->WriteSentinel(916326043);
    WriteIPDLParam(msg__, this, aTimestamp);
    // Sentinel = 'aTimestamp'
    (msg__)->WriteSentinel(367330326);
    WriteIPDLParam(msg__, this, aExtraSizeData);
    // Sentinel = 'aExtraSizeData'
    (msg__)->WriteSentinel(689833339);
    WriteIPDLParam(msg__, this, aExtraStringData);
    // Sentinel = 'aExtraStringData'
    (msg__)->WriteSentinel(905315927);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_ObserveHttpActivity", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendInitBackground(Endpoint<mozilla::ipc::PBackgroundParent>&& aEndpoint) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_InitBackground(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, std::move(aEndpoint));
    // Sentinel = 'aEndpoint'
    (msg__)->WriteSentinel(292225955);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitBackground", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

