adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
auto PSocketProcessChild::SendPAltServiceConstructor(PAltServiceChild* actor) -> PAltServiceChild*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PAltServiceChild actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPAltServiceChild.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PAltServiceConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PAltServiceConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PAltServiceChild constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PAltServiceMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessChild::SendGetTLSClientCert(
        const nsCString& aHostName,
        const OriginAttributes& aOriginAttributes,
        const int32_t& aPort,
        const uint32_t& aProviderFlags,
        const uint32_t& aProviderTlsFlags,
        const ByteArray& aServerCert,
        const mozilla::Maybe<ByteArray>& aClientCert,
        const nsTArray<ByteArray>& aCollectedCANames,
        bool* aSucceeded,
        ByteArray* aOutCert,
        ByteArray* aOutKey,
        nsTArray<ByteArray>* aBuiltChain) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_GetTLSClientCert(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aHostName);
    // Sentinel = 'aHostName'
    (msg__)->WriteSentinel(290128769);
    WriteIPDLParam(msg__, this, aOriginAttributes);
    // Sentinel = 'aOriginAttributes'
    (msg__)->WriteSentinel(1021839089);
    WriteIPDLParam(msg__, this, aPort);
    // Sentinel = 'aPort'
    (msg__)->WriteSentinel(97452551);
    WriteIPDLParam(msg__, this, aProviderFlags);
    // Sentinel = 'aProviderFlags'
    (msg__)->WriteSentinel(701957530);
    WriteIPDLParam(msg__, this, aProviderTlsFlags);
    // Sentinel = 'aProviderTlsFlags'
    (msg__)->WriteSentinel(1025771213);
    WriteIPDLParam(msg__, this, aServerCert);
    // Sentinel = 'aServerCert'
    (msg__)->WriteSentinel(435553383);
    WriteIPDLParam(msg__, this, aClientCert);
    // Sentinel = 'aClientCert'
    (msg__)->WriteSentinel(420873295);
    WriteIPDLParam(msg__, this, aCollectedCANames);
    // Sentinel = 'aCollectedCANames'
    (msg__)->WriteSentinel(967968361);



    Message reply__;

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetTLSClientCert", OTHER);

    bool sendok__ = false;
    {
        AUTO_PROFILER_TRACING_MARKER("Sync IPC", "PSocketProcess::Msg_GetTLSClientCert", IPC);
        sendok__ = ChannelSend(msg__, (&(reply__)));
    }
    if ((!(sendok__))) {
        return false;
    }

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Received reply ",
            (&(reply__))->type(),
            mozilla::ipc::MessageDirection::eReceiving);
    }

    PickleIterator iter__{reply__};

    if ((!(ReadIPDLParam((&(reply__)), (&(iter__)), this, aSucceeded)))) {
        FatalError("Error deserializing 'bool'");
        return false;
    }
    // Sentinel = 'aSucceeded'
    if ((!(((&(reply__)))->ReadSentinel((&(iter__)), 357893095)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'bool'");
        return false;
    }
    if ((!(ReadIPDLParam((&(reply__)), (&(iter__)), this, aOutCert)))) {
        FatalError("Error deserializing 'ByteArray'");
        return false;
    }
    // Sentinel = 'aOutCert'
    if ((!(((&(reply__)))->ReadSentinel((&(iter__)), 231605032)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'ByteArray'");
        return false;
    }
    if ((!(ReadIPDLParam((&(reply__)), (&(iter__)), this, aOutKey)))) {
        FatalError("Error deserializing 'ByteArray'");
        return false;
    }
    // Sentinel = 'aOutKey'
    if ((!(((&(reply__)))->ReadSentinel((&(iter__)), 180683459)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'ByteArray'");
        return false;
    }
    if ((!(ReadIPDLParam((&(reply__)), (&(iter__)), this, aBuiltChain)))) {
        FatalError("Error deserializing 'ByteArray[]'");
        return false;
    }
    // Sentinel = 'aBuiltChain'
    if ((!(((&(reply__)))->ReadSentinel((&(iter__)), 422380613)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'ByteArray[]'");
        return false;
    }
    reply__.EndRead(iter__, reply__.type());

    return true;
}

auto PSocketProcessChild::SendPProxyConfigLookupConstructor(
        PProxyConfigLookupChild* actor,
        nsIURI* aUri,
        const uint32_t& aFlags) -> PProxyConfigLookupChild*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PProxyConfigLookupChild actor");
        return nullptr;
    }

