adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
    actor->SetManagerAndRegister(this);
    mManagedPProxyConfigLookupChild.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PProxyConfigLookupConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, aUri);
    // Sentinel = 'aUri'
    (msg__)->WriteSentinel(64225682);
    WriteIPDLParam(msg__, this, aFlags);
    // Sentinel = 'aFlags'
    (msg__)->WriteSentinel(129892943);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PProxyConfigLookupConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PProxyConfigLookupChild constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PProxyConfigLookupMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessChild::SendCachePushCheck(
        nsIURI* aPushedURL,
        const OriginAttributes& aOriginAttributes,
        const nsCString& aRequestString,
        mozilla::ipc::ResolveCallback<bool>&& aResolve,
        mozilla::ipc::RejectCallback&& aReject) -> void
{
    IPC::Message* msg__ = PSocketProcess::Msg_CachePushCheck(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aPushedURL);
    // Sentinel = 'aPushedURL'
    (msg__)->WriteSentinel(358155198);
    WriteIPDLParam(msg__, this, aOriginAttributes);
    // Sentinel = 'aOriginAttributes'
    (msg__)->WriteSentinel(1021839089);
    WriteIPDLParam(msg__, this, aRequestString);
    // Sentinel = 'aRequestString'
    (msg__)->WriteSentinel(712771010);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_CachePushCheck", OTHER);

    ChannelSend(msg__, std::move(aResolve), std::move(aReject));
    return;
}

auto PSocketProcessChild::SendCachePushCheck(
        nsIURI* aPushedURL,
        const OriginAttributes& aOriginAttributes,
        const nsCString& aRequestString) -> RefPtr<CachePushCheckPromise>
{
    RefPtr<MozPromise<bool, ResponseRejectReason, true>::Private> promise__ = new MozPromise<bool, ResponseRejectReason, true>::Private(__func__);
    promise__->UseDirectTaskDispatch(__func__);
    SendCachePushCheck(std::move(aPushedURL), std::move(aOriginAttributes), std::move(aRequestString), [promise__](bool&& aValue) {
        promise__->Resolve(std::move(aValue), __func__);
    }, [promise__](ResponseRejectReason&& aReason) {
        promise__->Reject(std::move(aReason), __func__);
    });
    return promise__;
}

auto PSocketProcessChild::SendODoHServiceActivated(const bool& aActivated) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_ODoHServiceActivated(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aActivated);
    // Sentinel = 'aActivated'
    (msg__)->WriteSentinel(355664887);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_ODoHServiceActivated", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessChild::SendPFileDescriptorSetConstructor(const FileDescriptor& fd) -> PFileDescriptorSetChild*
{
    PFileDescriptorSetChild* actor = (static_cast<SocketProcessChild*>(this))->AllocPFileDescriptorSetChild(fd);
    return SendPFileDescriptorSetConstructor(actor, fd);
}

auto PSocketProcessChild::SendPFileDescriptorSetConstructor(
        PFileDescriptorSetChild* actor,
        const FileDescriptor& fd) -> PFileDescriptorSetChild*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PFileDescriptorSetChild actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPFileDescriptorSetChild.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PFileDescriptorSetConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, fd);
    // Sentinel = 'fd'
    (msg__)->WriteSentinel(20054219);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PFileDescriptorSetConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PFileDescriptorSetChild constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PFileDescriptorSetMsgStart, actor);

        return nullptr;
    }
    return actor;
}

