adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
            return MsgProcessed;
        }
    case PSocketProcess::Msg_RequestMemoryReport__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_RequestMemoryReport", OTHER);

            PickleIterator iter__{msg__};
            uint32_t generation{};
            bool anonymize{};
            bool minimizeMemoryUsage{};
            mozilla::Maybe<FileDescriptor> DMDFile{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(generation)))))) {
                FatalError("Error deserializing 'uint32_t'");
                return MsgValueError;
            }
            // Sentinel = 'generation'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 381158445)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'uint32_t'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(anonymize)))))) {
                FatalError("Error deserializing 'bool'");
                return MsgValueError;
            }
            // Sentinel = 'anonymize'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 321127387)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'bool'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(minimizeMemoryUsage)))))) {
                FatalError("Error deserializing 'bool'");
                return MsgValueError;
            }
            // Sentinel = 'minimizeMemoryUsage'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 1321600977)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'bool'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(DMDFile)))))) {
                FatalError("Error deserializing 'FileDescriptor?'");
                return MsgValueError;
            }
            // Sentinel = 'DMDFile'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 143983190)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'FileDescriptor?'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            int32_t id__ = MSG_ROUTING_CONTROL;
            int32_t seqno__ = msg__.seqno();
            RefPtr<mozilla::ipc::ActorLifecycleProxy> proxy__ =
                GetLifecycleProxy();

            RequestMemoryReportResolver resolver = [proxy__, seqno__, id__](const uint32_t& aParam) {
                if (!proxy__->Get()) {
                    NS_WARNING("Not resolving response because actor is dead.");
                    return;
                }
                PSocketProcessChild* self__ = static_cast<PSocketProcessChild*>(proxy__->Get());

                IPC::Message* reply__ = PSocketProcess::Reply_RequestMemoryReport(id__);
                reply__->set_seqno(seqno__);

                bool resolve__ = true;
                WriteIPDLParam(reply__, self__, resolve__);
                // Sentinel = 'resolve__'
                (reply__)->WriteSentinel(322044863);
                WriteIPDLParam(reply__, self__, aParam);
                // Sentinel = 'aGeneration'
                (reply__)->WriteSentinel(430179438);

                if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                    mozilla::ipc::LogMessageForProtocol(
                        "PSocketProcessChild",
                        (self__)->OtherPid(),
                        "Sending reply ",
                        reply__->type(),
                        mozilla::ipc::MessageDirection::eSending);
                }

                bool sendok__ = self__->ChannelSend(reply__);
                if (!sendok__) {
                    NS_WARNING("Error sending reply");
                }
            };
            if ((!((static_cast<SocketProcessChild*>(this))->RecvRequestMemoryReport(std::move(generation), std::move(anonymize), std::move(minimizeMemoryUsage), std::move(DMDFile), std::move(resolver))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            return MsgProcessed;
        }
    case PSocketProcess::Msg_SetOffline__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_SetOffline", OTHER);

            PickleIterator iter__{msg__};
            bool offline{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(offline)))))) {
                FatalError("Error deserializing 'bool'");
                return MsgValueError;
            }
            // Sentinel = 'offline'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 194904804)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'bool'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            if ((!((static_cast<SocketProcessChild*>(this))->RecvSetOffline(std::move(offline))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

