adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessChild.cpp
            return MsgProcessed;
        }
    case PSocketProcess::Msg_SetConnectivity__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_SetConnectivity", OTHER);

            PickleIterator iter__{msg__};
            bool connectivity{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(connectivity)))))) {
                FatalError("Error deserializing 'bool'");
                return MsgValueError;
            }
            // Sentinel = 'connectivity'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 548734240)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'bool'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            if ((!((static_cast<SocketProcessChild*>(this))->RecvSetConnectivity(std::move(connectivity))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            return MsgProcessed;
        }
    case PSocketProcess::Msg_InitLinuxSandbox__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitLinuxSandbox", OTHER);

            PickleIterator iter__{msg__};
            mozilla::Maybe<FileDescriptor> sandboxBroker{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(sandboxBroker)))))) {
                FatalError("Error deserializing 'FileDescriptor?'");
                return MsgValueError;
            }
            // Sentinel = 'sandboxBroker'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 625149269)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'FileDescriptor?'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            if ((!((static_cast<SocketProcessChild*>(this))->RecvInitLinuxSandbox(std::move(sandboxBroker))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            return MsgProcessed;
        }
    case PSocketProcess::Msg_InitSocketProcessBridgeParent__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitSocketProcessBridgeParent", OTHER);

            PickleIterator iter__{msg__};
            ProcessId processId{};
            Endpoint<mozilla::net::PSocketProcessBridgeParent> endpoint{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(processId)))))) {
                FatalError("Error deserializing 'ProcessId'");
                return MsgValueError;
            }
            // Sentinel = 'processId'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 318243757)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'ProcessId'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(endpoint)))))) {
                FatalError("Error deserializing 'Endpoint<mozilla::net::PSocketProcessBridgeParent>'");
                return MsgValueError;
            }
            // Sentinel = 'endpoint'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 251724642)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'Endpoint<mozilla::net::PSocketProcessBridgeParent>'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            if ((!((static_cast<SocketProcessChild*>(this))->RecvInitSocketProcessBridgeParent(std::move(processId), std::move(endpoint))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            return MsgProcessed;
        }
    case PSocketProcess::Msg_InitProfiler__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitProfiler", OTHER);

            PickleIterator iter__{msg__};
            Endpoint<mozilla::PProfilerChild> aEndpoint{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aEndpoint)))))) {
                FatalError("Error deserializing 'Endpoint<mozilla::PProfilerChild>'");
                return MsgValueError;
            }
            // Sentinel = 'aEndpoint'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 292225955)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'Endpoint<mozilla::PProfilerChild>'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            if ((!((static_cast<SocketProcessChild*>(this))->RecvInitProfiler(std::move(aEndpoint))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

